cf/Catalogs/НастройкиPostman.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиPostman</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтчетыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеудач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОчетыСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/НастройкиPostman.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиPostman</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/ОтчетыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОтчетыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаДанных</Name>
					<Comment>0 - метаданные, 1 - запрос, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разрешено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запрещено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Итоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппировкиИтога</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/НастройкиPostman/Ext/ManagerModule.bsl
//ФОРМИРОВАНИЕ И ОТПРАВКА ПАКЕТОВ
Процедура  СформироватьПакет(Ссылка, ТЗОшибок,ТЗКорзинаПисем, Excel = Неопределено) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяЛиста");
	ТЗ.Колонки.Добавить("ФорматФайла");
	ТЗ.Колонки.Добавить("ТабДок");
	
	Попытка
		
		Если Excel = Неопределено Тогда
			ФлагВыйтиИзExcel = Истина;
			Excel = Новый COMОбъект("Excel.Application");    
			Excel.Visible = 0;    
			Excel.DisplayAlerts = 0;
		КонецЕсли;
		
		
	
		Если Ссылка.ЭтоГруппа Тогда //соберем отчеты по группе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиPostman.Ссылка
			|ИЗ
			|	Справочник.НастройкиPostman КАК НастройкиPostman
			|ГДЕ
			|	НастройкиPostman.Родитель = &Родитель
			|	И НЕ НастройкиPostman.ПометкаУдаления
			|	И НастройкиPostman.Использование
			|	И НЕ НастройкиPostman.Заблокирован";
			
			Запрос.УстановитьПараметр("Родитель", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьТаблицуMXLДокументами(ТЗ, Выборка.Ссылка, ТЗОшибок);
			КонецЦикла;
		Иначе
			ЗаполнитьТаблицуMXLДокументами(ТЗ, Ссылка, ТЗОшибок);
		КонецЕсли;
		
		Если ТЗ.Количество() Тогда
			// MXL1, MXL2... -> XLS
			Попытка
				ИмяФайлаExcel = СохранитьПакетВExcelФайл(Excel,ТЗ);	
			Исключение
				ЗаписатьОшибку(ТЗОшибок,Ссылка, "Неудалось сохранить пакет в Excel файл" + ОписаниеОшибки(), Истина);
			КонецПопытки;
			
			//Добавляем к Отправке
			Если ИмяФайлаExcel <> Неопределено Тогда
				Попытка
					ДополнитьКорзинуПисем(Ссылка, ИмяФайлаExcel, ТЗКорзинаПисем)
				Исключение
					ЗаписатьОшибку(ТЗОшибок,Ссылка, "Неудалось добавить письмо к отправке" + ОписаниеОшибки(), Истина);
				КонецПопытки;

				Попытка
					УдалитьФайлы(ИмяФайлаExcel);	
				Исключение
					ЗаписатьОшибку(ТЗОшибок,Ссылка, "Ошибка функции СформироватьПакет   " + ОписаниеОшибки(), Истина);
				КонецПопытки;
				
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		ЗаписатьОшибку(ТЗОшибок,Ссылка, "Ошибка функции СформироватьПакет   " + ОписаниеОшибки(), Истина);
	КонецПопытки;
	
	Если ФлагВыйтиИзExcel = Истина Тогда
		Excel.Quit();	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТаблицуMXLДокументами(ТЗ, Ссылка, ТЗОшибок)
	ТабДок = Новый ТабличныйДокумент;
	СчНеудач = 0;
	Пока Не СформироватьОтчет(Ссылка, ТабДок) Цикл
		СчНеудач = СчНеудач + 1;
		Если СчНеудач >= Ссылка.КоличествоНеудач Тогда
			

			СпрЭл = Ссылка.ПолучитьОбъект();
			СпрЭл.Заблокирован = Истина;
			СпрЭл.Записать();
			//Лог
			Описание = "Ошибка формирования отчета. Превышен лимит попыток = " + Ссылка.КоличествоНеудач;
			ЗаписатьОшибку(ТЗОшибок, Ссылка, Описание, Истина );
			
		    Область = ТабДок.Область("R1C1");
			Область.Текст = Описание;
			Область.Шрифт = Новый Шрифт(Область.Шрифт,,20,Истина);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.ИмяЛиста = Ссылка.ИмяЛиста;
	НоваяСтрока.ФорматФайла =  Ссылка.ФорматФайла;
	НоваяСтрока.ТабДок = ТабДок;
КонецПроцедуры

Процедура ЗаписатьОшибку(ТЗОшибок, Источник, Описание, ОповеститьАдминистратора = Ложь)
	
	НоваяСтрока = ТЗОшибок.Добавить();
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.Источник = Источник;
	НоваяСтрока.Описание = Описание;
	НоваяСтрока.ОповеститьАдминистратора = ОповеститьАдминистратора;
	
	
КонецПроцедуры

Функция СформироватьОтчет(Ссылка, ТабДок) Экспорт
	
	Попытка
		Настройки = Ссылка.НастройкиОтчета.Получить();
		Справочники.ОтчетыПользователей.СформироватьНаСервере(Ссылка.Отчет,Настройки,ТабДок);	
	Исключение
		Возврат Ложь
	КонецПопытки;
	Возврат Истина
КонецФункции // ()

Функция  СохранитьПакетВExcelФайл(Excel,ТЗ)
    
	ИмяВрФайла0 = ПолучитьИмяВременногоФайла(ТЗ[0].ФорматФайла);
	ТЗ[0].ТабДок.Записать(ИмяВрФайла0,?(ТЗ[0].ФорматФайла = "xlsx", ТипФайлаТабличногоДокумента.XLSX,ТипФайлаТабличногоДокумента.XLS));
	
	Попытка                          
		Книга = Excel.Workbooks.Open(ИмяВрФайла0);
		Книга.Worksheets(1).Name = ТЗ[0].ИмяЛиста;		 
		
	Исключение
		Книга = Excel.Workbooks.Add();
		Книга.SaveAs(ИмяВрФайла0);
	КонецПопытки;
	
	Для Каждого Эл Из ТЗ Цикл
		Если ТЗ.Индекс(Эл) = 0 Тогда
			Продолжить;
		КонецЕсли;
		ИмяВрФайла = ПолучитьИмяВременногоФайла(Эл.ФорматФайла);
		Эл.ТабДок.Записать(ИмяВрФайла,?(Эл.ФорматФайла = "xlsx", ТипФайлаТабличногоДокумента.XLSX,ТипФайлаТабличногоДокумента.XLS));
		
		Попытка                          
			Лист = Excel.Workbooks.Open(ИмяВрФайла);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Попытка
			Лист.Worksheets(1).Name = Эл.ИмяЛиста;
		Исключение
			Лист.Worksheets(1).Name = Эл.ИмяЛиста+"A";
		КонецПопытки;
		Лист.Worksheets(1).Copy(Книга.Worksheets(Книга.Worksheets.Count));	
		Книга.Sheets(Книга.Sheets.Count).Move(Книга.Sheets(Книга.Sheets.Count-1));
		Лист.Close(0);
		УдалитьФайлы(ИмяВрФайла);
	КонецЦикла;
	
	Книга.Save();
	Книга.Close(-1);
	
	Возврат ИмяВрФайла0
	
	
КонецФункции

Процедура ДополнитьКорзинуПисем(Ссылка, ИмяФайлаExcel, ТЗКорзинаПисем)
	Для каждого Эл Из Ссылка.Получатели Цикл
		Вложение = Новый ДвоичныеДанные(ИмяФайлаExcel);
		 Если Эл.Email <> "" Тогда
		 	 НоваяСтрока = ТЗКорзинаПисем.Добавить();
			 НоваяСтрока.Email = СокрЛП(Эл.Email);
			 НоваяСтрока.ПредставлениеВложения = Ссылка.ИмяФайла + ?(Найти(ИмяФайлаExcel,".xlsx"),".xlsx",".xls" );
		 	 НоваяСтрока.Вложение = Вложение;
		 КонецЕсли;
	 КонецЦикла;
КонецПроцедуры

Процедура ОтправитьКорзинуПисем(ТЗОшибок, ТЗКорзинаПисем) Экспорт
	//Группируем по Email
	ТЗШапка = ТЗКорзинаПисем.Скопировать(,"Email");
	ТЗШапка.Свернуть("Email");

	УчетнаяЗапись = РегистрыСведений.НастройкиPostman.Получить(Новый Структура("Ключ","УчетнаяЗаписьЭлектроннойПочты")).Значение;
	//Шапка письма
	Для Каждого ЭлПисьмо Из ТЗШапка Цикл
		Попытка
			ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭлПисьмо.Email);
		Исключение
			
			ЗаписатьОшибку(ТЗОшибок,,"Не удалось оработать Email:" + ЭлПисьмо.Email, Истина);
			
			Продолжить;
		КонецПопытки;
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
		ПараметрыПисьма.Вставить("Тема", "POSTMAN");
		Вложения = Новый Соответствие;
		
		//Вложения
		МассивВложений = ТЗКорзинаПисем.НайтиСтроки(Новый Структура("Email", ЭлПисьмо.Email));
		Для каждого Эл Из МассивВложений Цикл
		
			Вложения.Вставить(Эл.ПредставлениеВложения, Эл.Вложение);
		
		КонецЦикла;
	
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		Попытка
			ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);	
		Исключение
			ЗаписатьОшибку(ТЗОшибок,,"Не удалось отправить письмо на Email:" + ЭлПисьмо.Email, Истина);
		    Продолжить;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
